x = input('Введите значение переменной x: ')
y = input('Введите значение переменной y: ')
print(type(x), type(y),'\nИмеют тип строки, приведем их к числовому значению')

print('Конкатенация строк: ', x + y)

x = int(x)
y = int(y)

print('x - ', type(x), '\ny - ', type(y))

print('Умножение переменных: ', x * y)
print('Сложение перемнных: ', x + y)
print('Деление переменных: ', x / y)
print('Возведение в во 2-ую степень каждую из переменных: x = ', x ** 2, 'y = ', y ** 2)
print('Получаем остаток от деления: ', x % y)
print('Целочисленное деление: ', x // y)